Revit 2024 API
IFCExtrusionCreationData.AllowVerticalOffsetOfBReps Property
 Allows vertical shifting of breps when moving towards the origin.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool AllowVerticalOffsetOfBReps { get; set; }
Visual Basic
Public Property AllowVerticalOffsetOfBReps As Boolean
	Get
	Set
Visual C++
public:
property bool AllowVerticalOffsetOfBReps {
	bool get ();
	void set (bool value);
}
See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace